JanNiklasJuedt/MEEGA-Software/MEEGA-STM32/MEEGA Temperature Sensors/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define GPIO_Input_CSTSB_Pin GPIO_PIN_1
#define GPIO_Input_CSTSB_GPIO_Port GPIOB
#define GPIO_Output_LED1_Pin GPIO_PIN_8
#define GPIO_Output_LED1_GPIO_Port GPIOA
#define GPIO_Output_LED2_Pin GPIO_PIN_11
#define GPIO_Output_LED2_GPIO_Port GPIOA
#define GPIO_Output_CS1_Pin GPIO_PIN_3
#define GPIO_Output_CS1_GPIO_Port GPIOB
#define GPIO_Output_CS2_Pin GPIO_PIN_4
#define GPIO_Output_CS2_GPIO_Port GPIOB
#define GPIO_Output_CS3_Pin GPIO_PIN_5
#define GPIO_Output_CS3_GPIO_Port GPIOB
#define GPIO_Output_CS4_Pin GPIO_PIN_6
#define GPIO_Output_CS4_GPIO_Port GPIOB
#define GPIO_Output_CS5_Pin GPIO_PIN_7
#define GPIO_Output_CS5_GPIO_Port GPIOB
#define GPIO_Output_CS6_Pin GPIO_PIN_8
#define GPIO_Output_CS6_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
